ThaoVy1607/MSP430_Ultrasonic_SIM7670C/examples/common/hal/fr6043EVM/hal_uart.c
    // Configure UART
    EUSCI_A_UART_initParam param = {0};
    param.parity = EUSCI_A_UART_NO_PARITY;
    param.msborLsbFirst = EUSCI_A_UART_LSB_FIRST;
    param.numberofStopBits = EUSCI_A_UART_ONE_STOP_BIT;
    param.uartMode = EUSCI_A_UART_MODE;


#if ((HAL_SYS_SMCLK_FREQ_HZ ==8000000) && (HAL_UART_BAUDRATE == 57600))
    param.selectClockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK;
    param.clockPrescalar = 8;           // 8000000/16/57600 = 8.68
    param.firstModReg = 10;              // UCOS16=1, BRFx = 10, BRSx = 0xF7
    param.secondModReg = 0xF7;
    param.overSampling = EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION;
#elif ((HAL_SYS_SMCLK_FREQ_HZ==8000000) && (HAL_UART_BAUDRATE == 115200))
    param.selectClockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK;
    param.clockPrescalar = 4;           // 8000000/16/115200 = 4.34
    param.firstModReg = 5;              // UCOS16=1, BRFx = 5, BRSx = 0x55
    param.secondModReg = 0x55;
    param.overSampling = EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION;
#elif ((HAL_UART_BAUDRATE == 9600) && (HAL_SYS_ACLK_FREQ_HZ==32768))
    param.selectClockSource = EUSCI_A_UART_CLOCKSOURCE_ACLK;
    param.clockPrescalar = 3;           // 32768/9600 = 3.41
    param.firstModReg = 0;              // UCOS16=0 BRFx = 0, BRSx = 0x92
    param.secondModReg = 0x92;
    param.overSampling = EUSCI_A_UART_LOW_FREQUENCY_BAUDRATE_GENERATION;
#else
    #error "UART Baudrate Configuration not supported "
#endif

    if(STATUS_FAIL == EUSCI_A_UART_init(HAL_UART_BASE_ADDR, &param))
    {
        return;
    }
    EUSCI_A_UART_enable(HAL_UART_BASE_ADDR);

}


void hal_uart_RxEnableIntMode(void)
{
    // Enable USCI_A0 RX interrupt
   EUSCI_A_UART_clearInterrupt(HAL_UART_BASE_ADDR,
                                EUSCI_A_UART_RECEIVE_INTERRUPT);
   EUSCI_A_UART_enableInterrupt(HAL_UART_BASE_ADDR,
                                 EUSCI_A_UART_RECEIVE_INTERRUPT);
}


void hal_uart_RxDisableIntMode(void)
{
    // Disable USCI_A1 RX interrupt
    EUSCI_A_UART_disableInterrupt(HAL_UART_BASE_ADDR,
                                 EUSCI_A_UART_RECEIVE_INTERRUPT);
}



void hal_uart_TxByte(uint8_t Data)
{
    EUSCI_A_UART_transmitData(HAL_UART_BASE_ADDR, Data);
}


bool hal_uart_RxPeekByte(uint8_t *byte)
{
    if ( EUSCI_A_UART_getInterruptStatus(HAL_UART_BASE_ADDR,
                                        EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG) )
    {
        *byte = EUSCI_A_UART_receiveData(HAL_UART_BASE_ADDR);
        EUSCI_A_UART_clearInterrupt(HAL_UART_BASE_ADDR,
                                    EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG);
        return true;
    }

    return false;
}



//
// Interrupt Service Routines
//
//*****************************************************************************
//
//! ISR for UART
//!
//! Interrupt Service Routine for UART serial communication with a PC
//! The ISR passes the data to a Callback event which parses the data
//!
//! \return none
//
// *****************************************************************************
#pragma vector=USCI_A1_VECTOR
__interrupt void hal_uart_ISR(void)
{
    switch(__even_in_range(UCA1IV,USCI_UART_UCTXCPTIFG))
    {
    case USCI_NONE: break;
    case USCI_UART_UCRXIFG:
        // Routine is executed when a byte is received via UART
        guRxData = EUSCI_A_UART_receiveData(HAL_UART_BASE_ADDR);
        // Send the received byte to TI_Serial_Comm
        //if (hal_uart_DataRx_Event(Data) == true)
        {
            LPM3_EXIT;
        }
      break;
    case USCI_UART_UCTXIFG: break;
    case USCI_UART_UCSTTIFG: break;
    case USCI_UART_UCTXCPTIFG: break;
  }
}
